Lab4/report/report.tex
% Created 2016-12-10 Sat 18:55
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\author{Karolina Ziomek, Rasmus Holm}
\date{\today}
\title{Big Data Analytics \\ 732A54 \\ Lab 4}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\newpage

\section*{Exercise 1}
\label{sec-1}
\subsection*{Output}
\label{sec-1-1}
\subsubsection*{Question}
\label{sec-1-1-1}
\paragraph*{Minimums}
\label{sec-1-1-1-1}
Row(year=u'1990', temp=-35.0)
Row(year=u'1952', temp=-35.5)
Row(year=u'1974', temp=-35.6)
Row(year=u'1954', temp=-36.0)
Row(year=u'1992', temp=-36.1)
Row(year=u'1975', temp=-37.0)
Row(year=u'1972', temp=-37.5)
Row(year=u'2000', temp=-37.6)
Row(year=u'1995', temp=-37.6)
Row(year=u'1957', temp=-37.8)
Row(year=u'1983', temp=-38.2)
Row(year=u'1989', temp=-38.2)
Row(year=u'1953', temp=-38.4)
Row(year=u'2009', temp=-38.5)
Row(year=u'1993', temp=-39.0)
\paragraph*{Maximums}
\label{sec-1-1-1-2}
Row(year=u'1975', temp=36.1)
Row(year=u'1992', temp=35.4)
Row(year=u'1994', temp=34.7)
Row(year=u'2014', temp=34.4)
Row(year=u'2010', temp=34.4)
Row(year=u'1989', temp=33.9)
Row(year=u'1982', temp=33.8)
Row(year=u'1968', temp=33.7)
Row(year=u'1966', temp=33.5)
Row(year=u'1983', temp=33.3)
Row(year=u'2002', temp=33.3)
Row(year=u'1986', temp=33.2)
Row(year=u'1970', temp=33.2)
Row(year=u'1956', temp=33.0)
Row(year=u'2000', temp=33.0)
\subsubsection*{a)}
\label{sec-1-1-2}
\paragraph*{Minimums}
\label{sec-1-1-2-1}
Row(year=u'1990', station=166870, temp=-35.0)
Row(year=u'1952', station=192830, temp=-35.5)
Row(year=u'1974', station=166870, temp=-35.6)
Row(year=u'1954', station=113410, temp=-36.0)
Row(year=u'1992', station=179960, temp=-36.1)
Row(year=u'1975', station=157860, temp=-37.0)
Row(year=u'1972', station=167860, temp=-37.5)
Row(year=u'1995', station=182910, temp=-37.6)
Row(year=u'2000', station=169860, temp=-37.6)
Row(year=u'1957', station=159970, temp=-37.8)
Row(year=u'1983', station=191900, temp=-38.2)
Row(year=u'1989', station=166870, temp=-38.2)
Row(year=u'1953', station=183760, temp=-38.4)
Row(year=u'2009', station=179960, temp=-38.5)
Row(year=u'1993', station=191900, temp=-39.0)
\paragraph*{Maximums}
\label{sec-1-1-2-2}
Row(year=u'1975', station=86200, temp=36.1)
Row(year=u'1992', station=63600, temp=35.4)
Row(year=u'1994', station=117160, temp=34.7)
Row(year=u'2010', station=75250, temp=34.4)
Row(year=u'2014', station=96560, temp=34.4)
Row(year=u'1989', station=63050, temp=33.9)
Row(year=u'1982', station=94050, temp=33.8)
Row(year=u'1968', station=137100, temp=33.7)
Row(year=u'1966', station=151640, temp=33.5)
Row(year=u'2002', station=78290, temp=33.3)
Row(year=u'1983', station=98210, temp=33.3)
Row(year=u'1970', station=103080, temp=33.2)
Row(year=u'1986', station=76470, temp=33.2)
Row(year=u'2000', station=62400, temp=33.0)
Row(year=u'1956', station=145340, temp=33.0)
\subsection*{Code}
\label{sec-1-2}
\subsubsection*{Initialization}
\label{sec-1-2-1}
\begin{minted}[]{python}
def exercise01():
data = sc.textFile("/user/x_rahol/data/temperature-readings.csv")

observations = data.map(lambda line: line.split(";")) \
.filter(lambda obs:
(int(obs[1][:4]) >= 1950 and
    int(obs[1][:4]) <= 2014)) \
.map(lambda obs: Row(station=int(obs[0]),
                                year=obs[1].split("-")[0],
                                temp=float(obs[3])))

schema_temp_readings = sqlContext.createDataFrame(observations)
schema_temp_readings.registerTempTable("temp_readings")

exercise01question()
exercise01a()
\end{minted}
\subsubsection*{Question}
\label{sec-1-2-2}
\begin{minted}[]{python}
def exercise01question():
year_min_temp = sqlContext.sql(
"""
        SELECT year, MIN(temp) AS temp
        FROM temp_readings
        GROUP BY year
        ORDER BY temp DESC
        """
)

year_max_temp = sqlContext.sql(
"""
        SELECT year, MAX(temp) AS temp
        FROM
        temp_readings
        GROUP BY year
        ORDER BY temp DESC
        """
)

year_min_temp.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (year, temp): temp) \
.saveAsTextFile("sql_result/1_qa")
year_max_temp.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (year, temp): temp) \
.saveAsTextFile("sql_result/1_qb")
\end{minted}
\subsubsection*{a)}
\label{sec-1-2-3}
\begin{minted}[]{python}
def exercise01a():
year_min_temp = sqlContext.sql(
"""
        SELECT DISTINCT(tr.year) AS year, FIRST(tr.station) AS station, 
               FIRST(temp) AS temp
        FROM temp_readings AS tr
        INNER JOIN
        (
        SELECT year, MIN(temp) AS min_temp
        FROM temp_readings
        GROUP BY year
        ) AS tbl
        ON tr.year = tbl.year
        WHERE tr.temp = tbl.min_temp
        GROUP BY tr.year
        ORDER BY temp DESC
        """
)

year_max_temp = sqlContext.sql(
"""
        SELECT DISTINCT(tr.year) AS year, FIRST(tr.station) AS station, 
               FIRST(temp) AS temp
        FROM temp_readings AS tr
        INNER JOIN
        (
        SELECT year, MAX(temp) AS max_temp
        FROM temp_readings
        GROUP BY year
        ) AS tbl
        ON tr.year = tbl.year
        WHERE tr.temp = tbl.max_temp
        GROUP BY tr.year
        ORDER BY temp DESC
        """
)

year_min_temp.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (year, station, temp): temp) \
.saveAsTextFile("sql_result/1_aa")
year_max_temp.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (year, station, temp): temp) \
.saveAsTextFile("sql_result/1_ab")
\end{minted}

\newpage
\section*{Exercise 2}
\label{sec-2}
\subsection*{Output}
\label{sec-2-1}
\subsubsection*{a)}
\label{sec-2-1-1}
Row(month=u'2014-07', count=147681)
Row(month=u'2011-07', count=146656)
Row(month=u'2010-07', count=143419)
Row(month=u'2012-07', count=137477)
Row(month=u'2013-07', count=133657)
Row(month=u'2009-07', count=133008)
Row(month=u'2011-08', count=132734)
Row(month=u'2009-08', count=128349)
Row(month=u'2013-08', count=128235)
Row(month=u'2003-07', count=128133)
Row(month=u'2002-07', count=127956)
Row(month=u'2006-08', count=127622)
Row(month=u'2008-07', count=126973)
Row(month=u'2002-08', count=126073)
Row(month=u'2005-07', count=125294)
\subsubsection*{b)}
\label{sec-2-1-2}
Row(month=u'1972-10', count=378)
Row(month=u'1973-06', count=377)
Row(month=u'1973-05', count=377)
Row(month=u'1972-08', count=376)
Row(month=u'1973-09', count=376)
Row(month=u'1972-06', count=375)
Row(month=u'1972-05', count=375)
Row(month=u'1971-08', count=375)
Row(month=u'1972-09', count=375)
Row(month=u'1971-06', count=374)
Row(month=u'1972-07', count=374)
Row(month=u'1971-09', count=374)
Row(month=u'1973-08', count=373)
Row(month=u'1971-05', count=373)
Row(month=u'1974-08', count=372)
\subsection*{Code}
\label{sec-2-2}
\subsubsection*{Initialization}
\label{sec-2-2-1}
\begin{minted}[]{python}
def exercise02():
data = sc.textFile("/user/x_rahol/data/temperature-readings.csv")

observations = data.map(lambda line: line.split(";")) \
.filter(lambda obs:
(int(obs[1][:4]) >= 1950 and
    int(obs[1][:4]) <= 2014)) \
.map(lambda obs: Row(station=int(obs[0]),
                                month=obs[1][:7],
                                temp=float(obs[3])))

schema_temp_readings = sqlContext.createDataFrame(observations)
schema_temp_readings.registerTempTable("temp_readings")

# exercise02a()
exercise02aAPI(schema_temp_readings)
# exercise02b()
exercise02bAPI(schema_temp_readings)
\end{minted}
\subsubsection*{a)}
\label{sec-2-2-2}
\begin{minted}[]{python}
def exercise02aAPI(table):
month_count = table.filter(table["temp"] > 10) \
.groupBy("month") \
.agg(F.count("*").alias("count")) \
.orderBy(F.count("*").desc())

month_count.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (month, count): count) \
.saveAsTextFile("sql_result/2_a")
\end{minted}
\subsubsection*{b)}
\label{sec-2-2-3}
\begin{minted}[]{python}
def exercise02bAPI(table):
month_distinct_count = table.filter(table["temp"] > 10) \
.groupBy("month") \
.agg(F.countDistinct("station").alias("count"))

month_distinct_count.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (month, count): count) \
.saveAsTextFile("sql_result/2_b")
\end{minted}

\newpage
