Lab4/report/report.org
** Output
Row(month=u'2014-07', station=96000, avg_temp=26.3)
Row(month=u'1994-07', station=96550, avg_temp=23.07105263157895)
Row(month=u'1983-08', station=54550, avg_temp=23.0)
Row(month=u'1994-07', station=78140, avg_temp=22.97096774193548)
Row(month=u'1994-07', station=85280, avg_temp=22.872580645161296)
Row(month=u'1994-07', station=75120, avg_temp=22.85806451612903)
Row(month=u'1994-07', station=65450, avg_temp=22.85645161290323)
Row(month=u'1994-07', station=96000, avg_temp=22.80806451612904)
Row(month=u'1994-07', station=95160, avg_temp=22.76451612903225)
Row(month=u'1994-07', station=86200, avg_temp=22.71129032258064)
Row(month=u'2002-08', station=78140, avg_temp=22.7)
Row(month=u'1994-07', station=76000, avg_temp=22.698387096774198)
Row(month=u'1997-08', station=78140, avg_temp=22.666129032258066)
Row(month=u'1994-07', station=105260, avg_temp=22.659677419354843)
Row(month=u'1975-08', station=54550, avg_temp=22.642857142857142)
** Code
#+BEGIN_SRC python
def exercise03():
data = sc.textFile("/user/x_rahol/data/temperature-readings.csv")

observations = data.map(lambda line: line.split(";")) \
.filter(lambda obs:
(int(obs[1][:4]) >= 1960 and
    int(obs[1][:4]) <= 2014)) \
.map(lambda obs: Row(station=int(obs[0]),
                                day=obs[1],
                                month=obs[1][:7],
                                temp=float(obs[3])))

schema_temp_readings = sqlContext.createDataFrame(observations)
schema_temp_readings.registerTempTable("temp_readings")

station_month_avg_temps = sqlContext.sql(
"""
        SELECT mytbl.month, mytbl.station, 
               AVG(mytbl.max_temp + mytbl.min_temp) / 2 AS avg_temp
        FROM
        (
        SELECT month, station, MIN(temp) AS min_temp, MAX(temp) AS max_temp
        FROM temp_readings
        GROUP BY day, month, station
        ) AS mytbl
        GROUP BY mytbl.month, mytbl.station
        ORDER BY AVG(mytbl.max_temp + mytbl.min_temp) / 2 DESC
        """
)

station_month_avg_temps.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (month, station, temp): temp) \
.saveAsTextFile("sql_result/3")
#+END_SRC
\newpage
* Exercise 4
** Output
Row(station=97510, max_temp=30.0, max_precip=103.99999999999999)
Row(station=75250, max_temp=30.0, max_precip=101.8)
Row(station=71420, max_temp=30.0, max_precip=106.3)
Row(station=52350, max_temp=30.0, max_precip=101.6)
\newline
** Code
#+BEGIN_SRC python
def exercise04():
temperature_data = sc.textFile("/user/x_rahol/data/temperature-readings.csv")
precipitation_data = sc.textFile("/user/x_rahol/data/precipitation-readings.csv")

temperature_obs = temperature_data.map(lambda line: line.split(";")) \
.map(lambda obs: Row(station=int(obs[0]),
                                temp=float(obs[3])))

precipitation_obs = precipitation_data.map(lambda line: line.split(";")) \
.map(lambda obs: Row(station=int(obs[0]),
                                day=obs[1],
                                precip=float(obs[3])))

schema_temp_readings = sqlContext.createDataFrame(temperature_obs)
schema_temp_readings.registerTempTable("temp_readings")

schema_precip_readings = sqlContext.createDataFrame(precipitation_obs)
schema_precip_readings.registerTempTable("precip_readings")

combined = sqlContext.sql(
"""
        SELECT tr.station, MAX(temp) AS max_temp, MAX(precip) AS max_precip
        FROM
        temp_readings AS tr
        INNER JOIN
        (
        SELECT station, SUM(precip) AS precip
        FROM precip_readings
        GROUP BY day, station
        ) AS pr
        ON tr.station = pr.station
        WHERE temp >= 25 AND temp <= 30
        AND precip >= 100 AND precip <= 200
        GROUP BY tr.station
        ORDER BY tr.station DESC
        """
)

combined.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (station, temp, precip): station) \
.saveAsTextFile("sql_result/4")
#+END_SRC
\newpage
* Exercise 5
** Output
Row(month=u'2016-07', avg_precip=0.0)
Row(month=u'2016-06', avg_precip=47.6625)
Row(month=u'2016-05', avg_precip=29.250000000000004)
Row(month=u'2016-04', avg_precip=26.9)
Row(month=u'2016-03', avg_precip=19.9625)
Row(month=u'2016-02', avg_precip=21.5625)
Row(month=u'2016-01', avg_precip=22.325)
Row(month=u'2015-12', avg_precip=28.925)
Row(month=u'2015-11', avg_precip=63.887499999999996)
Row(month=u'2015-10', avg_precip=2.2625)
Row(month=u'2015-09', avg_precip=101.3)
Row(month=u'2015-08', avg_precip=26.987499999999997)
Row(month=u'2015-07', avg_precip=119.10000000000001)
Row(month=u'2015-06', avg_precip=78.66250000000001)
Row(month=u'2015-05', avg_precip=93.22500000000002)
** Code
#+BEGIN_SRC python
def exercise05():
station_data = sc.textFile("/user/x_rahol/data/stations-Ostergotland.csv")

stations = station_data.map(lambda line: line.split(";")) \
.map(lambda obs: int(obs[0])) \
.distinct().collect()
stations = sc.broadcast(stations)
stations = {station: True for station in stations.value}

precipitation_data = sc.textFile("/user/x_rahol/data/precipitation-readings.csv")

precipitation_obs = precipitation_data.map(lambda line: line.split(";")) \
.filter(lambda obs: stations.get(int(obs[0]), False)) \
.map(lambda obs: Row(day=obs[1],
                            month=obs[1][:7],
                            station=int(obs[0]),
                            precip=float(obs[3])))

schema_precip_readings = sqlContext.createDataFrame(precipitation_obs)
schema_precip_readings.registerTempTable("precip_readings")

precipitation_avg_month = sqlContext.sql(
"""
        SELECT mytbl2.month, AVG(mytbl2.precip) AS avg_precip
        FROM
        (
        SELECT mytbl1.month, mytbl1.station, SUM(mytbl1.precip) AS precip
        FROM
        (
        SELECT month, station, SUM(precip) AS precip
        FROM precip_readings
        GROUP BY day, month, station
        ) AS mytbl1
        GROUP BY mytbl1.month, mytbl1.station
        ) AS mytbl2
        GROUP BY mytbl2.month
        ORDER BY mytbl2.month DESC
        """
)

precipitation_avg_month.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (month, precip): month) \
.saveAsTextFile("sql_result/5")
#+END_SRC
\newpage
* Exercise 6
** Output
Row(month=u'2014-12', temp=-0.793851783409785)
Row(month=u'2014-11', temp=2.063539672692896)
Row(month=u'2014-10', temp=1.5219574906179707)
Row(month=u'2014-09', temp=0.06105818643722216)
Row(month=u'2014-08', temp=-0.6426470719706945)
Row(month=u'2014-07', temp=2.1059218387139786)
Row(month=u'2014-06', temp=-1.8073686197315162)
Row(month=u'2014-05', temp=0.26719065014070154)
Row(month=u'2014-04', temp=2.0661931589915445)
Row(month=u'2014-03', temp=3.1764989502346417)
Row(month=u'2014-02', temp=-2.2292398859946143)
Row(month=u'2014-01', temp=-0.9325880207201744)
Row(month=u'2013-12', temp=1.9232603493728853)
Row(month=u'2013-11', temp=0.9342517939050214)
Row(month=u'2013-10', temp=0.7523093967763295)
** Code
