Lab4/report/report.tex
\subsection*{Code}
\label{sec-6-2}
\subsubsection*{Data}
\label{sec-6-2-1}
\begin{minted}[]{python}
def exercise06():
station_data = sc.textFile("/user/x_rahol/data/stations-Ostergotland.csv")

stations = station_data.map(lambda line: line.split(";")) \
.map(lambda obs: int(obs[0])) \
.distinct().collect()
stations = sc.broadcast(stations)
stations = {station: True for station in stations.value}

temperature_data = sc.textFile("/user/x_rahol/data/temperature-readings.csv")

temperature_data_filtered = temperature_data.map(lambda line: line.split(";")) \
.filter(lambda obs:
(stations.get(int(obs[0]), False) and
             int(obs[1][:4]) >= 1950 and
             int(obs[1][:4]) <= 2014)) \
.map(lambda obs: Row(station=int(obs[0]),
                                day=obs[1],
                                month=obs[1][:7],
                                temp=float(obs[3])))

schema_temp_readings = sqlContext.createDataFrame(temperature_data_filtered)
schema_temp_readings.registerTempTable("temp_readings")

month_avg_temp = sqlContext.sql(
"""
        SELECT mytbl.month, AVG(mytbl.max_temp + mytbl.min_temp) / 2 AS avg_temp
        FROM
        (
        SELECT month, station, MIN(temp) AS min_temp, MAX(temp) AS max_temp
        FROM temp_readings
        GROUP BY day, month, station
        ) AS mytbl
        GROUP BY mytbl.month
        """
)

longterm_avg_temp = month_avg_temp.filter(F.substring(month_avg_temp["month"], 
1, 4) <= 1980) \
.groupBy(F.substring(month_avg_temp["month"], 6, 7).alias("month")) \
.agg(F.avg(month_avg_temp["avg_temp"]).alias("longterm_avg_temp"))

result = month_avg_temp.join(longterm_avg_temp,
(F.substring(month_avg_temp["month"], 6, 7) ==
                    longterm_avg_temp["month"]), "inner") \
.select(month_avg_temp["month"],
(F.abs(month_avg_temp["avg_temp"]) -
              F.abs(longterm_avg_temp["longterm_avg_temp"])).alias("temp")) \
.orderBy(month_avg_temp["month"].desc())

result.rdd.repartition(1) \
.sortBy(ascending=False, keyfunc=lambda (month, temp): month) \
.saveAsTextFile("sql_result/6")
\end{minted}
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}
